Courses/4420/Lectures/LinuxSetup/Config/config-lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-02 Wed 14:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab: Configuring a System Properly</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Configuring a System Properly</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1236de">1. Educational Objectives</a></li>
<li><a href="#org1bfec2f">2. Background</a></li>
<li><a href="#org1519b84">3. Lab for 201x CEG 4420/6420</a></li>
<li><a href="#org6b6c403">4. Tasks</a>
<ul>
<li><a href="#org37b26ee">4.1. Task:  Install a Linux Distro</a></li>
<li><a href="#orgcaaa33f">4.2. Task:  DAC Examples</a></li>
<li><a href="#orge5b01b4">4.3. Task:  File Permissions, Etc</a></li>
<li><a href="#orgb487d1d">4.4. Task:  Check for Weak Logins</a></li>
<li><a href="#org1978a21">4.5. Task:  Configure /etc/sudoers</a></li>
<li><a href="#org8351890">4.6. Task:  Examine suid Programs</a></li>
<li><a href="#org0fb1124">4.7. Task:  AppArmor and Google Chrome</a></li>
<li><a href="#org6f83f6e">4.8. Task:  [Bonus Task] Revive Bastille Linux Script</a></li>
</ul>
</li>
<li><a href="#org77c9b16">5. TurnIn</a></li>
<li><a href="#orgb0bdea5">6. References</a></li>
<li><a href="#orgf94efba">7. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge1236de" class="outline-2">
<h2 id="orge1236de"><span class="section-number-2">1</span> Educational Objectives</h2>
<div class="outline-text-2" id="text-1">
<p>
Millions of machines are connected to the Internet are personal
machines running Windows and Linux with little supervision from system
administrators.  These have become targets of script kiddies. This
lecture and the associated lab experiment are intended to help
configure personal systems running Linux.
</p>

<p>
Objectives
</p>

<ol class="org-ol">
<li>Examine a Linux installation for what needs to be properly
configured, postponing fortification and hardening to later labs.</li>

<li>Recognize that out of the box installations of OS are insecure.</li>

<li>Know the typical problem spots.</li>
</ol>
</div>
</div>

<div id="outline-container-org1bfec2f" class="outline-2">
<h2 id="org1bfec2f"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>This lab is not net-centric; so there is no need for the NetUtils
setup.</li>

<li>This lab asks for a certain number of fixes in the categories of
(i) properly configured, and (ii) fortified,  (iii)
hardening [postponing to a later lab].</li>

<li>Write the fixes you suggest as a bash script named
&lt;tt&gt;configProperly.sh&lt;/tt&gt; that can be applied by root.  Include
these scripts as appendices to the lab report.  These scripts can
include commands such as &lt;tt&gt;wget URL&lt;/tt&gt; or &lt;tt&gt;apt-get
install/remove package&lt;/tt&gt;.  You are welcome to use a language
other than bash; change the file name extension accordingly.</li>

<li>Should you be unable to find such fixes, report on what you
discovered, and stake a claim that the Linux distribution you chose
was "so perfect".  If we discover otherwise, you will earn
corresponding negative points.</li>

<li>Required Reading and Recopmmended Reading: See References</li>
</ol>
</div>
</div>


<div id="outline-container-org1519b84" class="outline-2">
<h2 id="org1519b84"><span class="section-number-2">3</span> Lab for 201x CEG 4420/6420</h2>
<div class="outline-text-2" id="text-3">
<p>
This lab gets you started on proper config.  It is not exhaustive.
</p>

<ol class="org-ol">
<li>Task: Install a Linux Distro</li>
<li>Task: DAC Examples</li>
<li>Task: Configure /etc/sudoers</li>
<li>Task: Examine suid Programs</li>
<li>Task: AppArmor and Google Chrome</li>
</ol>
</div>
</div>

<div id="outline-container-org6b6c403" class="outline-2">
<h2 id="org6b6c403"><span class="section-number-2">4</span> Tasks</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org37b26ee" class="outline-3">
<h3 id="org37b26ee"><span class="section-number-3">4.1</span> Task:  Install a Linux Distro</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>You will need a USB drive of 8 GB or higher capacity.  Install a
Linux distribution of your choice, but within the Ubuntu family,
onto the USB drive as if it is a HDD.
<ol class="org-ol">
<li>This can be the multiboot USBD you created in an earlier lab.
You will need to mount the system read-and-write.  The so-called
frugal-install or ISO based installs will not do.</li>
<li>Should you wish to work with non-Ubuntu distros, adapt the
following appropriately.</li>
</ol></li>

<li>Establish at least 5 ordinary users with names and passwords of
your choice.  Learn how to to do this as a script.  Include the
script in your submission.</li>

<li>We will refer to this installation as LXU.  Boot the PC into LXU.
Login as needed, as an ordinary user or as root.</li>
</ol>
</div>
</div>

<div id="outline-container-orgcaaa33f" class="outline-3">
<h3 id="orgcaaa33f"><span class="section-number-3">4.2</span> Task:  DAC Examples</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Take five examples as-is from LXU and explain DAC ideas.</li>
</ol>
</div>
</div>

<div id="outline-container-orge5b01b4" class="outline-3">
<h3 id="orge5b01b4"><span class="section-number-3">4.3</span> Task:  File Permissions, Etc</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>Find and report all files with peculiar permissions.  Examples: no
permissions given <code>--- --- ---</code>, executable but not readable,
readable for group and others but not the owner, unsearchable
directories, etc.</li>

<li>Files and directories whose names begin with a dot are unlisted by
ls unless -a flag is used.  Find and report all such files and
directories whose size is larger than 10 MB.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb487d1d" class="outline-3">
<h3 id="orgb487d1d"><span class="section-number-3">4.4</span> Task:  Check for Weak Logins</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>No password shoul be breakable within an hour.  List the names and
plain text passwords of such users.  Assume you are root.</li>

<li>Should root be allowed to login? Ubuntu/ Debian do not assign a
passwd to root.  Discuss the pro/cons of this choice.</li>
<li>How will you assign a password to root?</li>
<li>What is the purpose of <code>/etc/securetty</code>?  The default installed has
many unnecessary entries.  Trim it.</li>
</ol>
</div>
</div>

<div id="outline-container-org1978a21" class="outline-3">
<h3 id="org1978a21"><span class="section-number-3">4.5</span> Task:  Configure /etc/sudoers</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li><p>
The <code>/etc/sudoers</code> file has a line
</p>
<pre class="example">
root    ALL=(ALL:ALL) ALL

</pre>
<p>
Suppose we delete this line.  What privileges does the root user lose?
</p></li>

<li>Out of the 5 users you created (let us call them U1 .. U5), permit
two users, U1 and U2, to be able to mount, umount only.</li>

<li>Assign two other users (U3 and U4) to group sudo.</li>

<li>Make appropriate changes so that U5 can do everything that root can.</li>
</ol>
</div>
</div>

<div id="outline-container-org8351890" class="outline-3">
<h3 id="org8351890"><span class="section-number-3">4.6</span> Task:  Examine suid Programs</h3>
<div class="outline-text-3" id="text-4-6">
<ol class="org-ol">
<li><p>
Make a list of suid root porgrams.  The following examines only /bin.
</p>
<pre class="example">
find /bin -user root -perm -4000 -exec ls -li {} \; &gt;/tmp/suid-bin.txt

</pre></li>
<li>For five of these, write a paragraph either defending its presence
or suggesting its suid status removal.</li>
</ol>
</div>
</div>

<div id="outline-container-org0fb1124" class="outline-3">
<h3 id="org0fb1124"><span class="section-number-3">4.7</span> Task:  AppArmor and Google Chrome</h3>
<div class="outline-text-3" id="text-4-7">
<ol class="org-ol">
<li><a href="https://wiki.ubuntu.com/AppArmor">AppArmor</a> is a Mandatory Access Control (MAC) system. This is
installed by default on Ubuntu systems.  Related files are at
<code>/etc/apparmor*</code>.  Read <a href="https://www.howtogeek.com/118222/htg-explains-what-apparmor-is-and-how-it-secures-your-ubuntu-system/">What Is AppArmor, and How Does It Keep
Ubuntu Secure?</a> by Chris Hoffman on September 28th, 2016</li>

<li>Install Google Chrome browser for Linux.  Develop an AppArmor
profile for Google Chrome based on the
<code>/etc/apparmor.d/usr.bin.firefox</code> FireFox profile.  This should be
your own work.  Include appropriate citations. Do not submit
cut-n-paste of what you may find by googling.</li>
</ol>
</div>
</div>

<div id="outline-container-org6f83f6e" class="outline-3">
<h3 id="org6f83f6e"><span class="section-number-3">4.8</span> Task:  [Bonus Task] Revive Bastille Linux Script</h3>
<div class="outline-text-3" id="text-4-8">
<ol class="org-ol">
<li><a href="https://sourceforge.net/projects/bastille-linux/">https://sourceforge.net/projects/bastille-linux/</a> Bastille Linux is
a proper config and Reporting/Auditing Program which enhances the
security of a Linux box, by configuring daemons, system settings
and firewalling. It currently functions on most major Linux
distributions and HP-UX.  [Has been inactive for years.]</li>

<li>Make this run properly on LXU and submit the report it generates.</li>

<li>Recommended Reading:
<a href="https://www.symantec.com/connect/articles/bastille-linux-walkthrough">https://www.symantec.com/connect/articles/bastille-linux-walkthrough</a> 2000</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org77c9b16" class="outline-2">
<h2 id="org77c9b16"><span class="section-number-2">5</span> TurnIn</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Submit on Pilot into the folder L4 Config Properly</li>
<li>The Lab Report should include a section that describes the chosen
LXU briefly, and a detailed section explaining the rationale behind
the changes (what and why) you suggest.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb0bdea5" class="outline-2">
<h2 id="orgb0bdea5"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>See the references of <a href="./index.html">Proper Configuration</a>.</li>
</ol>
</div>
</div>


<div id="outline-container-orgf94efba" class="outline-2">
<h2 id="orgf94efba"><span class="section-number-2">7</span> End</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-09-20
</div>
</body>
</html>
